app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @song.nil?
        redirect_to artists_path, alert: "Song not found"
      end
    else
      @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]